
//TODO

'''

Item : Python 100Ds days
Time : 20200525

循環結構:
    1. for...in..: 用在確定執行次數、對容器進行迭代
    2. while : 用在不確定執行次數 , 搭配布林運算, True = go , False = pass

'''

''' 
# range 寫法 #
range (101) : 0~100
range ( 1, 101 ): 1~100
range ( 1, 101 ,2 ) : 1~100, ,奇數, 每 2 個一次, 順向
range ( 100, 0, -2 ) : 100~0, 偶數, 每 2 個一次, 逆向

'''

# 練習 1 -- 計算1～100 ----------------------------------------------

sum = 0 # 起始值
for i in range(101):  # 計算100次
    sum += i          # 每計算一次疊加一次
print(sum)


# 練習 2-- 偶數求和 ----------------------------------------------------

sum = 0 
for i in range ( 2, 101, 2 ) :  # 起始 2, 終止 101 , 每 2 次計算
    sum += i 
print(sum)

# 加入分支結構 if 

sum = 0 
for j in range ( 1, 101):
    if j % 2 == 0 :  # if j/2 = 0 就跳過
        sum += j
print(sum)


# 練習 3 ---------------------------------------------------------------








   